open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_wifi_control.c
/****************************************************************************
 * chips/bk7258/common/
 * bk7258_wifi_control.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * CP-to-AP Wi-Fi control plane.  CP supplies ephemeral runtime credentials
 * and passive monitor requests; AP logical CPU0 calls the official
 * v3.1.1.9 proxy and applies the CP VNET lease to native NuttX wlan0.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_WIFI_VNET

#include <errno.h>
#include <pthread.h>
#include <sched.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>
#include <syslog.h>

#include <nuttx/clock.h>
#include <nuttx/mutex.h>
#include <nuttx/rpmsg/rpmsg.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>

#ifdef CONFIG_BK7258_AP_CORE
#  include <sys/ioctl.h>
#  include <sys/poll.h>
#  include <sys/socket.h>
#  include <syslog.h>
#  include <sys/time.h>

#  include <arpa/inet.h>
#  include <netinet/in.h>

#  include <nuttx/net/icmp.h>
#  include <nuttx/net/ip.h>
#  include <nuttx/net/net.h>

#endif

#include <arch/chip/bk7258_rptun.h>
#include <arch/chip/bk7258_amp.h>
#include <arch/chip/bk7258_radio_mode.h>
#include <arch/chip/bk7258_wifi.h>

#if defined(CONFIG_BK7258_WIFI_PACKET_DIAG) && \
    !defined(CONFIG_BK7258_AP_CORE)
#  include "bk7258_wifi_packet_diag.h"
#endif

#include "bk7258_rptun.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BK7258_WIFI_CONTROL_EPT_NAME          "bk7258-wifi"
#define BK7258_WIFI_CONTROL_MAGIC             0x49465742u /* "BWFI" */
#define BK7258_WIFI_CONTROL_VERSION           4u
#define BK7258_WIFI_CONTROL_SEND_TIMEOUT_MS   500u
#define BK7258_WIFI_CONTROL_ENDPOINT_WAIT_MS  3000u
#define BK7258_WIFI_CONTROL_POLL_MS            100u
#define BK7258_WIFI_LINK_SYNC_MS               250u
#define BK7258_WIFI_STA_STOP_COMMAND           0x312u
#define BK7258_WIFI_VENDOR_TIMEOUT             (-0x1006)
#define BK7258_WIFI_STOP_BARRIER_MS            8000u
#define BK7258_WIFI_PING_DATALEN              32u
#define BK7258_WIFI_PING_REPLY_SIZE           128u
#define BK7258_WIFI_EVENT_MOD_WIFI            1u
#define BK7258_WIFI_EVENT_SCAN_DONE           0
#define BK7258_WIFI_PASSWORD_MIN_LEN           8u

#ifdef CONFIG_BK7258_AP_CORE
#  define BK7258_WIFI_CONTROL_REMOTE_NAME     "cp"
#else
#  define BK7258_WIFI_CONTROL_REMOTE_NAME     "ap"
#endif

enum bk7258_wifi_control_command_e
{
  BK7258_WIFI_CONTROL_COMMAND_REQUEST = 1,
  BK7258_WIFI_CONTROL_COMMAND_REPORT
};

const char *bk7258_wifi_security_name(uint8_t security)
{
  switch (security)
    {
      case BK7258_WIFI_SECURITY_NONE:
        return "Open";
      case BK7258_WIFI_SECURITY_WEP:
        return "WEP";
      case BK7258_WIFI_SECURITY_WPA_TKIP:
        return "WPA-TKIP";
      case BK7258_WIFI_SECURITY_WPA_AES:
        return "WPA-AES";
      case BK7258_WIFI_SECURITY_WPA_MIXED:
        return "WPA-Mixed";
      case BK7258_WIFI_SECURITY_WPA2_TKIP:
        return "WPA2-TKIP";
      case BK7258_WIFI_SECURITY_WPA2_AES:
        return "WPA2-AES";
      case BK7258_WIFI_SECURITY_WPA2_MIXED:
        return "WPA2-Mixed";
      case BK7258_WIFI_SECURITY_WPA3_SAE:
        return "WPA3-SAE";
      case BK7258_WIFI_SECURITY_WPA3_WPA2_MIXED:
        return "WPA3-WPA2-Mixed";
      case BK7258_WIFI_SECURITY_EAP:
        return "EAP";
      case BK7258_WIFI_SECURITY_OWE:
        return "OWE";
      case BK7258_WIFI_SECURITY_AUTO:
        return "Auto";
      case BK7258_WIFI_SECURITY_WAPI_PSK:
        return "WAPI-PSK";
      case BK7258_WIFI_SECURITY_WAPI_CERT:
        return "WAPI-CERT";
      case BK7258_WIFI_SECURITY_WAPI_UNKNOWN:
        return "WAPI-Unknown";
      default:
        return NULL;
    }
}

static bool bk7258_wifi_password_length_valid(size_t length)
{
  return length == 0 ||
         (length >= BK7258_WIFI_PASSWORD_MIN_LEN &&
          length <= BK7258_WIFI_PASSWORD_MAX_LEN);
}

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_wifi_control_wire_s
{
  uint32_t magic;
  uint32_t version;
  uint32_t command;
  uint32_t generation;
  uint32_t sequence;
  uint32_t operation;
  uint32_t timeout_ms;
  uint32_t ssid_len;
  uint32_t password_len;
  uint32_t monitor_channel;
  struct bk7258_wifi_echo_s echo;
  struct bk7258_wifi_result_s result;
  struct bk7258_wifi_monitor_result_s monitor_result;
  struct bk7258_wifi_scan_result_s scan_result;
  char ssid[BK7258_WIFI_SSID_MAX_LEN + 1u];
  char password[BK7258_WIFI_PASSWORD_MAX_LEN + 1u];
};

struct bk7258_wifi_control_dev_s
{
  struct rpmsg_endpoint ept;
  bool initialized;
  bool endpoint_created;
  int connection_error;
#ifdef CONFIG_BK7258_AP_CORE
  sem_t request_sem;
  sem_t scan_sem;
  bool abort;
  bool busy;
  bool request_local;
  bool local_pending;
  bool local_scan;
  bool local_channels;
  bool local_ping;
  bool local_monitor_cleanup;
  bool scan_cleanup_pending;
  bool scan_callback_registered;
  bool scan_started;
  struct bk7258_wifi_channel_stats_s local_channel_result;
  struct bk7258_wifi_scan_result_s local_scan_result;
  struct bk7258_wifi_scan_snapshot_s local_scan_snapshot;
  bool local_done;
  bool local_cancel;
  bool trial_active;
  bool trial_touched;
  bool trial_connected;
  bool trial_restore_failed;
  bool saved_valid;
  bool trial_was_connected;
  uint32_t trial_lease;
  struct bk7258_wifi_control_wire_s saved_connection;
  struct bk7258_wifi_control_wire_s trial_connection;
  uint32_t local_ticket;
  struct bk7258_wifi_result_s local_result;
  bool native_link_valid;
  struct bk7258_wifi_result_s native_link;
  struct bk7258_wifi_control_wire_s request;
#else
  sem_t report_sem;
  bool report_valid;
  uint32_t waiting_generation;
  uint32_t waiting_sequence;
  struct bk7258_wifi_result_s report;
  struct bk7258_wifi_monitor_result_s monitor_report;
  struct bk7258_wifi_scan_result_s scan_report;
#endif
};

#ifdef CONFIG_BK7258_AP_CORE
/* Exact structures consumed by the immutable v3.1.1.9 AP Wi-Fi archive.
 * They stay private so vendor lwIP/config headers cannot redefine NuttX
 * CONFIG_* symbols in this translation unit.
 */

struct bk7258_wifi_sta_config_s
{
  char ssid[33];
  uint8_t bssid[6];
  uint8_t channel;
  uint8_t security;
  char password[65];
  uint8_t psk[65];
  uint8_t ip_addr[4];
  uint8_t netmask[4];
  uint8_t gateway[4];
  uint8_t dns1[4];
  uint8_t no_auto_fci;
  uint8_t user_fast_connect;
  uint8_t pmf;
  uint8_t tk[16];
  int auto_reconnect_count;
  int auto_reconnect_timeout;
  bool disable_auto_reconnect;
  FAR void *vsies[2];
  uint8_t reserved[32];
};

struct bk7258_wifi_monitor_channel_s
{
  uint8_t primary;
  uint8_t second;
};

/* Only the stable prefix consumed by this wrapper is described here.  The
 * immutable SDK owns the complete wifi_frame_info_t, including its private
 * tail.  Monitor data frames may already be converted to 802.3 by that SDK,
 * so this MVP deliberately aggregates metadata and never interprets or
 * exports frame bytes.
 */

