open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_wifi_control.c
struct bk7258_wifi_monitor_frame_info_s
{
  int32_t rssi;
  uint32_t len;
  uint32_t tsf_lo;
  uint32_t tsf_hi;
};

typedef int (*bk7258_wifi_monitor_callback_t)(
  FAR const uint8_t *frame, uint32_t len,
  FAR const struct bk7258_wifi_monitor_frame_info_s *frame_info);

struct bk7258_wifi_monitor_runtime_s
{
  uint32_t active;
  uint32_t session;
  uint32_t channel;
  uint32_t frame_count;
  uint32_t byte_count;
  int32_t last_rssi;
  int32_t min_rssi;
  int32_t max_rssi;
  uint32_t last_tsf_lo;
  uint32_t last_tsf_hi;
};

struct bk7258_wifi_scan_ap_sdk_s
{
  char ssid[33];
  uint8_t bssid[6];
  int32_t rssi;
  uint8_t channel;
  uint8_t security;
  uint8_t reserved[16];
};

struct bk7258_wifi_scan_result_sdk_s
{
  int32_t ap_num;
  FAR struct bk7258_wifi_scan_ap_sdk_s *aps;
};

typedef int (*bk7258_wifi_event_callback_t)(FAR void *arg,
                                             uint8_t event_module,
                                             int event_id,
                                             FAR void *event_data);

/* The official archive is compiled with -fshort-enums.  Keep the enum-backed
 * fields byte-sized even though this wrapper intentionally avoids importing
 * the SDK headers into a NuttX translation unit.  The offsets and copy sizes
 * below are also visible in the immutable archive's API implementation.
 */

_Static_assert(offsetof(struct bk7258_wifi_sta_config_s, security) == 40,
               "v3.1.1.9 STA security offset changed");
_Static_assert(offsetof(struct bk7258_wifi_sta_config_s, password) == 41,
               "v3.1.1.9 STA password offset changed");
_Static_assert(sizeof(struct bk7258_wifi_sta_config_s) == 260,
               "v3.1.1.9 STA config ABI changed");
_Static_assert(sizeof(struct bk7258_wifi_monitor_channel_s) == 2,
               "v3.1.1.9 monitor channel ABI changed");
_Static_assert(offsetof(struct bk7258_wifi_scan_ap_sdk_s, rssi) == 40,
               "v3.1.1.9 scan RSSI offset changed");
_Static_assert(offsetof(struct bk7258_wifi_scan_ap_sdk_s, channel) == 44,
               "v3.1.1.9 scan channel offset changed");
_Static_assert(sizeof(struct bk7258_wifi_scan_ap_sdk_s) == 64,
               "v3.1.1.9 scan AP ABI changed");
_Static_assert(sizeof(struct bk7258_wifi_scan_result_sdk_s) == 8,
               "v3.1.1.9 scan result ABI changed");
#endif

_Static_assert(sizeof(struct bk7258_wifi_control_wire_s) <=
               BK7258_RPTUN_BUFFER_SIZE - 16u,
               "Wi-Fi control message exceeds one RPMsg buffer");

/****************************************************************************
 * External Function Prototypes
 ****************************************************************************/

#ifdef CONFIG_BK7258_AP_CORE
extern int bk_wifi_sta_set_config(
  FAR const struct bk7258_wifi_sta_config_s *config);
extern int bk_wifi_sta_start(void);
extern int bk_wifi_sta_stop(void);
extern int bk_wifi_monitor_start(void);
extern int bk_wifi_monitor_stop(void);
extern int bk_wifi_monitor_set_channel(
  FAR const struct bk7258_wifi_monitor_channel_s *channel);
extern int bk_wifi_monitor_register_cb(
  bk7258_wifi_monitor_callback_t callback);
extern int bk_wifi_scan_start(FAR const void *config);
extern int bk_wifi_scan_stop(void);
extern int bk_wifi_scan_get_result(
  FAR struct bk7258_wifi_scan_result_sdk_s *result);
extern void bk_wifi_scan_free_result(
  FAR struct bk7258_wifi_scan_result_sdk_s *result);
extern int bk_event_register_cb(uint8_t event_module, int event_id,
                                bk7258_wifi_event_callback_t callback,
                                FAR void *arg);
extern int bk_event_unregister_cb(uint8_t event_module, int event_id,
                                  bk7258_wifi_event_callback_t callback);
extern int wifi_send_com_api_cmd(uint32_t command, uint32_t argc, ...);

static int bk7258_wifi_sync_native_link(
  FAR struct bk7258_wifi_result_s *result);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct bk7258_wifi_control_dev_s g_bk7258_wifi_control;

#ifdef CONFIG_BK7258_AP_CORE
static struct bk7258_wifi_monitor_runtime_s g_bk7258_wifi_monitor;
static mutex_t g_bk7258_wifi_local_lock = NXMUTEX_INITIALIZER;
#endif

#ifndef CONFIG_BK7258_AP_CORE
static mutex_t g_bk7258_wifi_control_lock = NXMUTEX_INITIALIZER;
static uint32_t g_bk7258_wifi_control_sequence;
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

#ifdef CONFIG_BK7258_AP_CORE
static bool bk7258_wifi_control_generation_ready(uint32_t generation)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();

  return generation != 0 &&
         control->magic == BK7258_RPTUN_CONTROL_MAGIC &&
         control->version == BK7258_RPTUN_CONTROL_VERSION &&
         control->generation == generation;
}
#endif

static bool bk7258_wifi_control_endpoint_ready(void)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;

  return __atomic_load_n(&priv->endpoint_created, __ATOMIC_ACQUIRE) &&
         priv->ept.rdev != NULL && priv->connection_error >= 0;
}

static int bk7258_wifi_control_send_bounded(
  FAR const struct bk7258_wifi_control_wire_s *message)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  uint32_t waited = 0;
  int ret;

  do
    {
      if (!bk7258_wifi_control_endpoint_ready())
        {
          return -ENOTCONN;
        }

      ret = rpmsg_trysend(&priv->ept, message, sizeof(*message));
      if (ret != -ENOMEM && ret != -EAGAIN)
        {
          return ret;
        }

      nxsig_usleep(1000);
      waited++;
    }
  while (waited < BK7258_WIFI_CONTROL_SEND_TIMEOUT_MS);

  return -ETIMEDOUT;
}

#ifdef CONFIG_BK7258_AP_CORE
struct bk7258_wifi_ping_packet_s
{
  struct icmp_hdr_s header;
  uint8_t payload[BK7258_WIFI_PING_DATALEN];
};

static int bk7258_wifi_vendor_result(int ret)
{
  return ret == 0 ? OK : (ret < 0 ? ret : -EIO);
}

static int bk7258_wifi_stop_sta(void)
{
  clock_t started;
  int ret;

  /* The official AP proxy returns success even when its two-second
   * STA_STOP confirmation wait expires.  Repeat the same no-argument SDK
   * command as a completion barrier: once it is confirmed, every earlier
   * stop request has completed on the serial CP control worker.  No pointer
   * argument is queued here, so a late confirmation cannot outlive an AP
   * buffer.
   */

  (void)bk_wifi_sta_stop();
  started = clock_systime_ticks();
  for (;;)
    {
      ret = bk7258_wifi_vendor_result(
        wifi_send_com_api_cmd(BK7258_WIFI_STA_STOP_COMMAND, 0));
      if (ret == OK)
        {
          /* Let any already-queued indication reach the AP RX worker before
           * retiring the immutable archive's stale link snapshot.
           */

          nxsig_usleep(BK7258_WIFI_LINK_SYNC_MS * 1000u);
          return bk7258_wifi_retire_link();
        }

      if (ret != BK7258_WIFI_VENDOR_TIMEOUT)
        {
          return ret;
        }

