open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_wifi_control.c
      if ((clock_systime_ticks() - started) >=
          MSEC2TICK(BK7258_WIFI_STOP_BARRIER_MS))
        {
          return -ETIMEDOUT;
        }

      nxsig_usleep(BK7258_WIFI_CONTROL_POLL_MS * 1000u);
    }
}

static void bk7258_wifi_monitor_add_saturated(FAR uint32_t *counter,
                                              uint32_t value)
{
  uint32_t current;
  uint32_t next;

  current = __atomic_load_n(counter, __ATOMIC_RELAXED);
  for (;;)
    {
      next = UINT32_MAX - current < value ? UINT32_MAX : current + value;
      if (__atomic_compare_exchange_n(counter, &current, next, false,
                                      __ATOMIC_RELEASE, __ATOMIC_RELAXED))
        {
          return;
        }
    }
}

static void bk7258_wifi_monitor_update_min(FAR int32_t *minimum,
                                           int32_t value)
{
  int32_t current = __atomic_load_n(minimum, __ATOMIC_RELAXED);

  while (value < current &&
         !__atomic_compare_exchange_n(minimum, &current, value, false,
                                      __ATOMIC_RELAXED, __ATOMIC_RELAXED))
    {
    }
}

static void bk7258_wifi_monitor_update_max(FAR int32_t *maximum,
                                           int32_t value)
{
  int32_t current = __atomic_load_n(maximum, __ATOMIC_RELAXED);

  while (value > current &&
         !__atomic_compare_exchange_n(maximum, &current, value, false,
                                      __ATOMIC_RELAXED, __ATOMIC_RELAXED))
    {
    }
}

static int bk7258_wifi_monitor_callback(
  FAR const uint8_t *frame, uint32_t len,
  FAR const struct bk7258_wifi_monitor_frame_info_s *frame_info)
{
  FAR struct bk7258_wifi_monitor_runtime_s *monitor =
    &g_bk7258_wifi_monitor;

  (void)frame;
  if (__atomic_load_n(&monitor->active, __ATOMIC_ACQUIRE) == 0)
    {
      return OK;
    }

  if (frame_info != NULL)
    {
      __atomic_store_n(&monitor->last_rssi, frame_info->rssi,
                       __ATOMIC_RELAXED);
      bk7258_wifi_monitor_update_min(&monitor->min_rssi,
                                     frame_info->rssi);
      bk7258_wifi_monitor_update_max(&monitor->max_rssi,
                                     frame_info->rssi);
      __atomic_store_n(&monitor->last_tsf_lo, frame_info->tsf_lo,
                       __ATOMIC_RELAXED);
      __atomic_store_n(&monitor->last_tsf_hi, frame_info->tsf_hi,
                       __ATOMIC_RELAXED);
    }

  bk7258_wifi_monitor_add_saturated(&monitor->byte_count, len);
  bk7258_wifi_monitor_add_saturated(&monitor->frame_count, 1u);

  return OK;
}

static void bk7258_wifi_monitor_snapshot(
  FAR struct bk7258_wifi_monitor_result_s *result)
{
  FAR struct bk7258_wifi_monitor_runtime_s *monitor =
    &g_bk7258_wifi_monitor;
  uint32_t frames;

  memset(result, 0, sizeof(*result));
  result->session = __atomic_load_n(&monitor->session, __ATOMIC_ACQUIRE);
  result->channel = __atomic_load_n(&monitor->channel, __ATOMIC_ACQUIRE);
  frames = __atomic_load_n(&monitor->frame_count, __ATOMIC_ACQUIRE);
  result->frame_count = frames;
  result->byte_count = __atomic_load_n(&monitor->byte_count,
                                        __ATOMIC_RELAXED);
  if (frames != 0)
    {
      result->last_rssi = __atomic_load_n(&monitor->last_rssi,
                                          __ATOMIC_RELAXED);
      result->min_rssi = __atomic_load_n(&monitor->min_rssi,
                                         __ATOMIC_RELAXED);
      result->max_rssi = __atomic_load_n(&monitor->max_rssi,
                                         __ATOMIC_RELAXED);
      result->last_tsf_lo = __atomic_load_n(&monitor->last_tsf_lo,
                                            __ATOMIC_RELAXED);
      result->last_tsf_hi = __atomic_load_n(&monitor->last_tsf_hi,
                                            __ATOMIC_RELAXED);
    }

  result->active = __atomic_load_n(&monitor->active, __ATOMIC_ACQUIRE);
}

static int bk7258_wifi_monitor_set_channel(uint32_t channel)
{
  struct bk7258_wifi_monitor_channel_s vendor_channel;
  int ret;

  if (channel < BK7258_WIFI_MONITOR_CHANNEL_MIN ||
      channel > BK7258_WIFI_MONITOR_CHANNEL_MAX)
    {
      return -EINVAL;
    }

  vendor_channel.primary = (uint8_t)channel;
  vendor_channel.second = 0;
  ret = bk7258_wifi_vendor_result(
    bk_wifi_monitor_set_channel(&vendor_channel));
  if (ret == OK)
    {
      __atomic_store_n(&g_bk7258_wifi_monitor.channel, channel,
                       __ATOMIC_RELEASE);
    }

  return ret;
}

static int bk7258_wifi_monitor_start_capture(uint32_t channel)
{
  FAR struct bk7258_wifi_monitor_runtime_s *monitor =
    &g_bk7258_wifi_monitor;
  uint32_t session;
  int ret;

  if (__atomic_load_n(&monitor->active, __ATOMIC_ACQUIRE) != 0)
    {
      return -EALREADY;
    }

  ret = bk7258_radio_mode_acquire(BK7258_RADIO_MODE_WIFI_MONITOR);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_wifi_stop_sta();
  if (ret < 0)
    {
      goto err_release;
    }

  ret = bk7258_wifi_vendor_result(
    bk_wifi_monitor_register_cb(bk7258_wifi_monitor_callback));
  if (ret < 0)
    {
      goto err_release;
    }

  session = __atomic_load_n(&monitor->session, __ATOMIC_RELAXED) + 1u;
  if (session == 0)
    {
      session = 1u;
    }

  __atomic_store_n(&monitor->session, session, __ATOMIC_RELAXED);
  __atomic_store_n(&monitor->frame_count, 0u, __ATOMIC_RELAXED);
  __atomic_store_n(&monitor->byte_count, 0u, __ATOMIC_RELAXED);
  __atomic_store_n(&monitor->last_rssi, 0, __ATOMIC_RELAXED);
  __atomic_store_n(&monitor->min_rssi, INT32_MAX, __ATOMIC_RELAXED);
  __atomic_store_n(&monitor->max_rssi, INT32_MIN, __ATOMIC_RELAXED);
  __atomic_store_n(&monitor->last_tsf_lo, 0u, __ATOMIC_RELAXED);
  __atomic_store_n(&monitor->last_tsf_hi, 0u, __ATOMIC_RELAXED);
  __atomic_store_n(&monitor->active, 1u, __ATOMIC_RELEASE);

  ret = bk7258_wifi_vendor_result(bk_wifi_monitor_start());
  if (ret < 0)
    {
      /* A failed start may still have enabled the controller. Keep the
       * lease if disabling it fails; a local diagnostic can retry cleanup. */
      int stop_ret = bk7258_wifi_vendor_result(bk_wifi_monitor_stop());
      if (stop_ret < 0) return stop_ret;
      __atomic_store_n(&monitor->active, 0u, __ATOMIC_RELEASE);
      goto err_release;
    }

  /* The pinned SDK initializes its RW driver in monitor_start. Its own
   * CLI also starts monitor before setting the channel: set_channel calls
   * rwnxl_reset_evt and must not run against an uninitialized monitor. */
  ret = bk7258_wifi_monitor_set_channel(channel);
  if (ret < 0)
    {
      int stop_ret = bk7258_wifi_vendor_result(bk_wifi_monitor_stop());
      if (stop_ret < 0) return stop_ret;
      __atomic_store_n(&monitor->active, 0u, __ATOMIC_RELEASE);
      goto err_release;
    }

  return ret;

err_release:
  (void)bk7258_radio_mode_release(BK7258_RADIO_MODE_WIFI_MONITOR);
  return ret;
}

static int bk7258_wifi_monitor_stop_capture(void)
{
  FAR struct bk7258_wifi_monitor_runtime_s *monitor =
    &g_bk7258_wifi_monitor;
  int ret;

