open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_wifi_control.c
  if (__atomic_load_n(&monitor->active, __ATOMIC_ACQUIRE) == 0)
    {
      return OK;
    }

  ret = bk7258_wifi_vendor_result(bk_wifi_monitor_stop());
  if (ret == OK)
    {
      __atomic_store_n(&monitor->active, 0u, __ATOMIC_RELEASE);
      ret = bk7258_radio_mode_release(BK7258_RADIO_MODE_WIFI_MONITOR);
    }

  return ret;
}

static int bk7258_wifi_scan_event(FAR void *arg, uint8_t event_module,
                                  int event_id, FAR void *event_data)
{
  FAR struct bk7258_wifi_control_dev_s *priv = arg;

  (void)event_data;
  if (priv == NULL || event_module != BK7258_WIFI_EVENT_MOD_WIFI ||
      event_id != BK7258_WIFI_EVENT_SCAN_DONE)
    {
      return -EINVAL;
    }

  (void)nxsem_post(&priv->scan_sem);
  return OK;
}

static void bk7258_wifi_scan_copy_ap(
  FAR struct bk7258_wifi_scan_ap_s *dest,
  FAR const struct bk7258_wifi_scan_ap_sdk_s *source)
{
  memset(dest, 0, sizeof(*dest));
  memcpy(dest->ssid, source->ssid, BK7258_WIFI_SSID_MAX_LEN);
  dest->ssid[BK7258_WIFI_SSID_MAX_LEN] = '\0';
  memcpy(dest->bssid, source->bssid, sizeof(dest->bssid));
  dest->rssi = source->rssi;
  dest->channel = source->channel;
  dest->security = source->security;
}

static void bk7258_wifi_scan_select_strongest(
  FAR struct bk7258_wifi_scan_ap_s *aps, uint32_t capacity,
  FAR uint32_t *found_out, FAR uint32_t *returned_out,
  FAR uint32_t *truncated_out,
  FAR const struct bk7258_wifi_scan_result_sdk_s *sdk)
{
  struct bk7258_wifi_scan_ap_s candidate;
  uint32_t found;
  uint32_t index;
  uint32_t position;

  found = sdk->ap_num > 0 ? (uint32_t)sdk->ap_num : 0u;
  *found_out = found;
  if (sdk->aps == NULL || capacity == 0u)
    {
      *truncated_out = found;
      return;
    }

  for (index = 0; index < found; index++)
    {
      bk7258_wifi_scan_copy_ap(&candidate, &sdk->aps[index]);
      if (*returned_out < capacity)
        {
          position = (*returned_out)++;
        }
      else if (candidate.rssi <=
               aps[capacity - 1u].rssi)
        {
          continue;
        }
      else
        {
          position = capacity - 1u;
        }

      while (position > 0 &&
             candidate.rssi > aps[position - 1u].rssi)
        {
          memcpy(&aps[position], &aps[position - 1u], sizeof(aps[position]));
          position--;
        }

      memcpy(&aps[position], &candidate, sizeof(candidate));
    }

  *truncated_out = *found_out - *returned_out;
}

static void bk7258_wifi_scan_result_from_snapshot(
  FAR struct bk7258_wifi_scan_result_s *result,
  FAR const struct bk7258_wifi_scan_snapshot_s *snapshot)
{
  uint32_t returned = snapshot->returned;

  if (returned > BK7258_WIFI_SCAN_MAX_RESULTS)
    {
      returned = BK7258_WIFI_SCAN_MAX_RESULTS;
    }

  memset(result, 0, sizeof(*result));
  result->status = snapshot->status;
  result->found = snapshot->found;
  result->returned = returned;
  result->truncated = snapshot->found - returned;
  memcpy(result->aps, snapshot->aps, returned * sizeof(result->aps[0]));
}

static int bk7258_wifi_scan_cleanup(void)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  int ret;
  if (!priv->scan_cleanup_pending) return OK;
  if (priv->scan_started)
    {
      ret = bk7258_wifi_vendor_result(bk_wifi_scan_stop());
      if (ret < 0) return ret;
      priv->scan_started = false;
    }
  if (priv->scan_callback_registered)
    {
      ret = bk7258_wifi_vendor_result(
        bk_event_unregister_cb(BK7258_WIFI_EVENT_MOD_WIFI,
                               BK7258_WIFI_EVENT_SCAN_DONE,
                               bk7258_wifi_scan_event));
      if (ret < 0) return ret;
      priv->scan_callback_registered = false;
    }
  ret = bk7258_radio_mode_release(BK7258_RADIO_MODE_WIFI_SCAN);
  if (ret == OK) priv->scan_cleanup_pending = false;
  return ret;
}

static int bk7258_wifi_scan(uint32_t timeout_ms,
                            FAR struct bk7258_wifi_scan_ap_s *aps,
                            uint32_t capacity, FAR uint32_t *found,
                            FAR uint32_t *returned, FAR uint32_t *truncated)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  struct bk7258_wifi_scan_result_sdk_s sdk;
  int cleanup_ret;
  int ret;
  if (aps == NULL || capacity == 0u || found == NULL || returned == NULL ||
      truncated == NULL)
    {
      return -EINVAL;
    }

  memset(aps, 0, capacity * sizeof(*aps));
  *found = 0;
  *returned = 0;
  *truncated = 0;
  memset(&sdk, 0, sizeof(sdk));
  ret = bk7258_wifi_scan_cleanup();
  if (ret < 0) return ret;
  ret = bk7258_radio_mode_acquire(BK7258_RADIO_MODE_WIFI_SCAN);
  if (ret < 0) return ret;
  priv->scan_cleanup_pending = true;
  while (nxsem_trywait(&priv->scan_sem) == OK) {}
  ret = bk7258_wifi_vendor_result(
    bk_event_register_cb(BK7258_WIFI_EVENT_MOD_WIFI,
                         BK7258_WIFI_EVENT_SCAN_DONE,
                         bk7258_wifi_scan_event, priv));
  if (ret < 0) goto out;
  priv->scan_callback_registered = true;
  priv->scan_started = true;
  ret = bk7258_wifi_vendor_result(bk_wifi_scan_start(NULL));
  if (ret < 0) goto out;
  for (uint32_t elapsed = 0; elapsed < timeout_ms; elapsed += 100)
    {
      if (priv->request_local &&
          __atomic_load_n(&priv->local_cancel, __ATOMIC_ACQUIRE))
        { ret = -ECANCELED; goto out; }
      ret = nxsem_tickwait_uninterruptible(&priv->scan_sem, MSEC2TICK(100));
      if (ret != -ETIMEDOUT) break;
    }
  if (ret < 0) goto out;
  priv->scan_started = false;
  ret = bk7258_wifi_vendor_result(bk_wifi_scan_get_result(&sdk));
  if (ret >= 0)
    {
      bk7258_wifi_scan_select_strongest(aps, capacity, found, returned,
                                        truncated, &sdk);
    }
out:
  if (sdk.aps != NULL) bk_wifi_scan_free_result(&sdk);
  cleanup_ret = bk7258_wifi_scan_cleanup();
  if (cleanup_ret < 0) ret = cleanup_ret;
  return ret;
}

static uint16_t bk7258_wifi_icmp_checksum(FAR const void *buffer,
                                          size_t length)
{
  FAR const uint16_t *word = buffer;
  uint32_t sum = 0;

