open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_wifi_control.c
  while (length > 1u)
    {
      sum += *word++;
      length -= 2u;
    }

  if (length != 0u)
    {
      sum += *(FAR const uint8_t *)word;
    }

  while ((sum >> 16) != 0u)
    {
      sum = (sum & UINT16_MAX) + (sum >> 16);
    }

  return (uint16_t)~sum;
}

static int bk7258_wifi_apply_native_lease(
  FAR const struct bk7258_wifi_result_s *result)
{
  /* CP owns DHCP in the official VNET flow.  Copy that one lease into the
   * native NuttX interface; never start a second DHCP client on AP.
   */

  return bk7258_wifi_set_native_lease(result);
}

static int bk7258_wifi_sync_native_link(
  FAR struct bk7258_wifi_result_s *result)
{
  FAR struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  int ret;

  ret = bk7258_wifi_read_link(result);
  if (ret < 0)
    {
      return ret;
    }

  if (priv->native_link_valid &&
      priv->native_link.link_state == result->link_state &&
      priv->native_link.ipaddr == result->ipaddr &&
      priv->native_link.netmask == result->netmask &&
      priv->native_link.router == result->router)
    {
      if (result->link_state != BK7258_WIFI_LINK_CONNECTED ||
          bk7258_wifi_native_lease_matches(result))
        {
          return OK;
        }

      syslog(LOG_WARNING,
             "BK7258 WIFI: native lease state drift; reapplying\n");
    }

  if (result->link_state == BK7258_WIFI_LINK_CONNECTED &&
      result->ipaddr != 0)
    {
      ret = bk7258_wifi_apply_native_lease(result);
      if (ret < 0)
        {
          return ret;
        }

      memcpy(&priv->native_link, result, sizeof(priv->native_link));
      priv->native_link_valid = true;
      return OK;
    }

  /* Keep a disconnected status query successful while removing the stale
   * route/carrier from the native interface.
   */

  (void)bk7258_wifi_clear_native_lease();
  memcpy(&priv->native_link, result, sizeof(priv->native_link));
  priv->native_link_valid = true;
  return OK;
}

static int bk7258_wifi_read_status(struct bk7258_wifi_result_s *result)
{
  /* A connected event can arrive just after a bounded CONNECT request has
   * timed out.  Synchronize the already-published CP lease here as well, so
   * the next STATUS request makes native wlan0 usable instead of reporting a
   * connected vendor link with no NuttX route.
   */

  return bk7258_wifi_sync_native_link(result);
}

static int bk7258_wifi_ping_gateway(struct bk7258_wifi_result_s *result,
                                    uint32_t timeout_ms)
{
  struct bk7258_wifi_ping_packet_s request;
  struct sockaddr_in destination;
  struct sockaddr_in source;
  struct socket psock;
  struct timeval timeout;
  FAR struct icmp_hdr_s *reply_header;
  uint8_t reply[BK7258_WIFI_PING_REPLY_SIZE];
  uint32_t filter;
  socklen_t source_length;
  size_t ip_header_length;
  uint16_t identifier;
  int close_ret;
  ssize_t length;
  int ret;
  unsigned int i;

  ret = bk7258_wifi_sync_native_link(result);
  if (ret < 0)
    {
      return ret;
    }

  if (result->link_state != BK7258_WIFI_LINK_CONNECTED ||
      result->ipaddr == 0 || result->router == 0)
    {
      return -ENETDOWN;
    }

  if (timeout_ms == 0u)
    {
      return -EINVAL;
    }

  /* The AP Wi-Fi control worker is a pthread in the initial task group.
   * Native descriptor-table lookup can contend indefinitely with that
   * group's SMP fd-list spinlock.  Use NuttX's native psock interface here:
   * it is the same ICMP stack and driver path, but owns its socket object
   * directly and therefore keeps this RPMsg request bounded.
   */

  memset(&psock, 0, sizeof(psock));
  ret = psock_socket(AF_INET, SOCK_RAW, IPPROTO_ICMP, &psock);
  if (ret < 0)
    {
      return ret;
    }

  filter = UINT32_MAX - (1u << ICMP_ECHO_REPLY);
  ret = psock_setsockopt(&psock, SOL_RAW, ICMP_FILTER,
                         &filter, sizeof(filter));
  if (ret < 0)
    {
      goto out_close;
    }

  timeout.tv_sec = timeout_ms / MSEC_PER_SEC;
  timeout.tv_usec = (timeout_ms % MSEC_PER_SEC) * USEC_PER_MSEC;
  ret = psock_setsockopt(&psock, SOL_SOCKET, SO_SNDTIMEO,
                         &timeout, sizeof(timeout));
  if (ret < 0)
    {
      goto out_close;
    }

  ret = psock_setsockopt(&psock, SOL_SOCKET, SO_RCVTIMEO,
                         &timeout, sizeof(timeout));
  if (ret < 0)
    {
      goto out_close;
    }

  memset(&request, 0, sizeof(request));
  request.header.type = ICMP_ECHO_REQUEST;
  identifier = (uint16_t)clock_systime_ticks();
  if (identifier == 0u)
    {
      identifier = 1u;
    }

  request.header.id = htons(identifier);
  request.header.seqno = htons(1u);
  for (i = 0; i < sizeof(request.payload); i++)
    {
      request.payload[i] = (uint8_t)(0x20u + i);
    }

  request.header.icmpchksum =
    bk7258_wifi_icmp_checksum(&request, sizeof(request));

  memset(&destination, 0, sizeof(destination));
  destination.sin_family = AF_INET;
  destination.sin_addr.s_addr = result->router;

  length = psock_sendto(&psock, &request, sizeof(request), 0,
                        (FAR const struct sockaddr *)&destination,
                        sizeof(destination));
  if (length < 0)
    {
      ret = (int)length;
      goto out_close;
    }
  else if (length != sizeof(request))
    {
      ret = -EIO;
      goto out_close;
    }

  memset(reply, 0, sizeof(reply));
  memset(&source, 0, sizeof(source));
  source_length = sizeof(source);
  length = psock_recvfrom(&psock, reply, sizeof(reply), 0,
                          (FAR struct sockaddr *)&source, &source_length);
  if (length < 0)
    {
      ret = length == -EAGAIN || length == -ETIMEDOUT ?
            -ETIMEDOUT : (int)length;
      goto out_close;
    }

  if (length < IPv4_HDRLEN + sizeof(struct icmp_hdr_s) ||
      source.sin_family != AF_INET ||
      source.sin_addr.s_addr != destination.sin_addr.s_addr)
    {
      ret = -EPROTO;
      goto out_close;
    }

  ip_header_length = (reply[0] & 0x0fu) * sizeof(uint32_t);
  if (ip_header_length < IPv4_HDRLEN ||
      (size_t)length < ip_header_length + sizeof(request))
    {
      ret = -EPROTO;
      goto out_close;
    }

  reply_header = (FAR struct icmp_hdr_s *)(reply + ip_header_length);
  if (reply_header->type != ICMP_ECHO_REPLY ||
      ntohs(reply_header->id) != identifier ||
      ntohs(reply_header->seqno) != 1u ||
      memcmp(reply_header + 1, request.payload,
             sizeof(request.payload)) != 0)
    {
      ret = -EPROTO;
      goto out_close;
    }

  ret = OK;

out_close:
  close_ret = psock_close(&psock);
  explicit_bzero(&request, sizeof(request));
  explicit_bzero(reply, sizeof(reply));
  return ret < 0 ? ret : close_ret;
}

static int bk7258_wifi_echo_set_timeout(FAR struct socket *psock,
                                        clock_t started,
                                        uint32_t timeout_ms)
{
  struct timeval timeout;
  uint32_t elapsed_ms;
  uint32_t remaining_ms;
  int ret;

  elapsed_ms = (uint32_t)TICK2MSEC(clock_systime_ticks() - started);
  if (elapsed_ms >= timeout_ms)
    {
      return -ETIMEDOUT;
    }

  remaining_ms = timeout_ms - elapsed_ms;
  timeout.tv_sec = remaining_ms / MSEC_PER_SEC;
  timeout.tv_usec = (remaining_ms % MSEC_PER_SEC) * USEC_PER_MSEC;
  ret = psock_setsockopt(psock, SOL_SOCKET, SO_SNDTIMEO,
                         &timeout, sizeof(timeout));
  if (ret >= 0)
    {
      ret = psock_setsockopt(psock, SOL_SOCKET, SO_RCVTIMEO,
                             &timeout, sizeof(timeout));
    }

  return ret;
}

static int bk7258_wifi_echo_socket_error(ssize_t value)
{
  if (value == -EAGAIN || value == -ETIMEDOUT
#if EWOULDBLOCK != EAGAIN
      || value == -EWOULDBLOCK
#endif
     )
    {
      return -ETIMEDOUT;
    }

  return (int)value;
}

