open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_wifi_control.c
static int bk7258_wifi_echo_connect(FAR struct socket *psock,
                                    FAR const struct sockaddr *address,
                                    socklen_t address_length,
                                    clock_t started,
                                    uint32_t timeout_ms)
{
  struct pollfd pfd;
  sem_t poll_sem;
  socklen_t error_length;
  uint32_t elapsed_ms;
  uint32_t remaining_ms;
  bool poll_setup;
  int socket_error;
  int nonblocking;
  int teardown_ret;
  int restore_ret;
  int ret;

  /* NuttX's blocking TCP connect waits with an infinite semaphore timeout;
   * SO_SNDTIMEO does not cover that wait.  Use the native psock nonblocking
   * path and its poll callback so one unreachable peer cannot wedge the sole
   * AP Wi-Fi control worker.
   */

  nonblocking = 1;
  ret = psock_ioctl(psock, FIONBIO,
                    (unsigned long)(uintptr_t)&nonblocking);
  if (ret < 0)
    {
      return ret;
    }

  ret = psock_connect(psock, address, address_length);
  if (ret == -EINPROGRESS)
    {
      memset(&pfd, 0, sizeof(pfd));
      nxsem_init(&poll_sem, 0, 0);
      pfd.fd = -1;
      pfd.events = POLLOUT | POLLERR | POLLHUP;
      pfd.arg = &poll_sem;
      pfd.cb = poll_default_cb;

      poll_setup = false;
      ret = psock_poll(psock, &pfd, true);
      if (ret >= 0)
        {
          poll_setup = true;
        }

      if (poll_setup && pfd.revents == 0)
        {
          elapsed_ms = (uint32_t)TICK2MSEC(clock_systime_ticks() -
                                           started);
          if (elapsed_ms >= timeout_ms)
            {
              ret = -ETIMEDOUT;
            }
          else
            {
              remaining_ms = timeout_ms - elapsed_ms;
              ret = nxsem_tickwait(&poll_sem,
                                   MSEC2TICK(remaining_ms));
            }
        }

      if (poll_setup)
        {
          teardown_ret = psock_poll(psock, &pfd, false);
          if (ret >= 0 && teardown_ret < 0)
            {
              ret = teardown_ret;
            }
        }

      if (ret >= 0)
        {
          socket_error = 0;
          error_length = sizeof(socket_error);
          ret = psock_getsockopt(psock, SOL_SOCKET, SO_ERROR,
                                 &socket_error, &error_length);
          if (ret >= 0 && socket_error != 0)
            {
              ret = -socket_error;
            }
          else if (ret >= 0 && (pfd.revents & POLLOUT) == 0)
            {
              ret = -ECONNABORTED;
            }
        }

      nxsem_destroy(&poll_sem);
    }

  nonblocking = 0;
  restore_ret = psock_ioctl(psock, FIONBIO,
                            (unsigned long)(uintptr_t)&nonblocking);
  return ret < 0 ? ret : restore_ret;
}

static void bk7258_wifi_echo_pattern(FAR uint8_t *buffer, size_t length,
                                     uint32_t sequence)
{
  size_t i;

  for (i = 0; i < length; i++)
    {
      buffer[i] = (uint8_t)(0x5au ^ (sequence * 17u) ^ i);
    }
}

static int bk7258_wifi_echo_exchange(
  FAR const struct bk7258_wifi_control_wire_s *request,
  FAR struct bk7258_wifi_result_s *result)
{
  struct sockaddr_in destination;
  struct sockaddr_in source;
  struct socket psock;
  uint8_t tx[BK7258_WIFI_ECHO_SIZE_MAX];
  uint8_t rx[BK7258_WIFI_ECHO_SIZE_MAX];
  clock_t started;
  socklen_t source_length;
  size_t transferred;
  ssize_t length;
  uint32_t sequence;
  int close_ret;
  int protocol;
  int type;
  int ret;

  ret = bk7258_wifi_sync_native_link(result);
  if (ret < 0)
    {
      return ret;
    }

  if (result->link_state != BK7258_WIFI_LINK_CONNECTED ||
      result->ipaddr == 0)
    {
      return -ENETDOWN;
    }

  if ((request->operation != BK7258_WIFI_OPERATION_TCP_ECHO &&
       request->operation != BK7258_WIFI_OPERATION_UDP_ECHO) ||
      request->echo.address == 0 ||
      request->echo.address == UINT32_MAX ||
      request->echo.port == 0 || request->echo.port > UINT16_MAX ||
      request->echo.count == 0 ||
      request->echo.count > BK7258_WIFI_ECHO_COUNT_MAX ||
      request->echo.size == 0 ||
      request->echo.size > BK7258_WIFI_ECHO_SIZE_MAX ||
      request->timeout_ms < BK7258_WIFI_ECHO_MIN_MS ||
      request->timeout_ms > BK7258_WIFI_CONNECT_MAX_MS)
    {
      return -EINVAL;
    }

  type = request->operation == BK7258_WIFI_OPERATION_TCP_ECHO ?
         SOCK_STREAM : SOCK_DGRAM;
  protocol = request->operation == BK7258_WIFI_OPERATION_TCP_ECHO ?
             IPPROTO_TCP : IPPROTO_UDP;
  memset(&psock, 0, sizeof(psock));
  ret = psock_socket(AF_INET, type, protocol, &psock);
  if (ret < 0)
    {
      return ret;
    }

  started = clock_systime_ticks();
  ret = bk7258_wifi_echo_set_timeout(&psock, started,
                                     request->timeout_ms);
  if (ret < 0)
    {
      goto out_close;
    }

  memset(&destination, 0, sizeof(destination));
  destination.sin_family = AF_INET;
  destination.sin_port = htons((uint16_t)request->echo.port);
  destination.sin_addr.s_addr = request->echo.address;

  if (type == SOCK_STREAM)
    {
      ret = bk7258_wifi_echo_connect(
        &psock, (FAR const struct sockaddr *)&destination,
        sizeof(destination), started, request->timeout_ms);
      if (ret < 0)
        {
          goto out_close;
        }
    }

  result->echo_count = 0;
  result->echo_bytes = 0;
  for (sequence = 0; sequence < request->echo.count; sequence++)
    {
      bk7258_wifi_echo_pattern(tx, request->echo.size, sequence);
      memset(rx, 0, request->echo.size);

      if (type == SOCK_STREAM)
        {
          transferred = 0;
          while (transferred < request->echo.size)
            {
              ret = bk7258_wifi_echo_set_timeout(&psock, started,
                                                  request->timeout_ms);
              if (ret < 0)
                {
                  goto out_close;
                }

              length = psock_send(&psock, tx + transferred,
                                  request->echo.size - transferred, 0);
              if (length <= 0)
                {
                  ret = length == 0 ? -EPIPE :
                        bk7258_wifi_echo_socket_error(length);
                  goto out_close;
                }

              transferred += (size_t)length;
            }

          transferred = 0;
          while (transferred < request->echo.size)
            {
              ret = bk7258_wifi_echo_set_timeout(&psock, started,
                                                  request->timeout_ms);
              if (ret < 0)
                {
                  goto out_close;
                }

              length = psock_recv(&psock, rx + transferred,
                                  request->echo.size - transferred, 0);
              if (length <= 0)
                {
                  ret = length == 0 ? -ECONNRESET :
                        bk7258_wifi_echo_socket_error(length);
                  goto out_close;
                }

              transferred += (size_t)length;
            }
        }
      else
        {
          ret = bk7258_wifi_echo_set_timeout(&psock, started,
                                              request->timeout_ms);
          if (ret < 0)
            {
              goto out_close;
            }

          length = psock_sendto(&psock, tx, request->echo.size, 0,
                                (FAR const struct sockaddr *)&destination,
                                sizeof(destination));
          if (length < 0)
            {
              ret = bk7258_wifi_echo_socket_error(length);
              goto out_close;
            }
          else if ((size_t)length != request->echo.size)
            {
              ret = -EIO;
              goto out_close;
            }

          ret = bk7258_wifi_echo_set_timeout(&psock, started,
                                              request->timeout_ms);
          if (ret < 0)
            {
              goto out_close;
            }

