open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_wifi_control.c
          memset(&source, 0, sizeof(source));
          source_length = sizeof(source);
          length = psock_recvfrom(&psock, rx, request->echo.size, 0,
                                  (FAR struct sockaddr *)&source,
                                  &source_length);
          if (length < 0)
            {
              ret = bk7258_wifi_echo_socket_error(length);
              goto out_close;
            }
          else if ((size_t)length != request->echo.size ||
                   source.sin_family != AF_INET ||
                   source.sin_port != destination.sin_port ||
                   source.sin_addr.s_addr != destination.sin_addr.s_addr)
            {
              ret = -EPROTO;
              goto out_close;
            }
        }

      if (memcmp(tx, rx, request->echo.size) != 0)
        {
          ret = -EBADMSG;
          goto out_close;
        }

      result->echo_count++;
      result->echo_bytes += request->echo.size;
    }

  ret = OK;

out_close:
  close_ret = psock_close(&psock);
  explicit_bzero(tx, sizeof(tx));
  explicit_bzero(rx, sizeof(rx));
  return ret < 0 ? ret : close_ret;
}

/* Private worker operations: never accepted from the CP request wire. */
#define BK7258_WIFI_LOCAL_CHANNELS 0x0fffu
#define BK7258_WIFI_LOCAL_CHANNELS_SWITCH 0x0ffeu
#define BK7258_WIFI_TRIAL_CONNECT 0x1000u
#define BK7258_WIFI_TRIAL_COMMIT  0x1001u
#define BK7258_WIFI_TRIAL_RESTORE 0x1002u

static int bk7258_wifi_channels_run(uint32_t dwell_ms, bool switch_sta)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  struct bk7258_wifi_channel_stats_s *result = &priv->local_channel_result;
  struct bk7258_wifi_result_s link;
  int ret;
  int stop_ret;
  memset(result, 0, sizeof(*result));
  result->dwell_ms = dwell_ms;
  if (priv->local_monitor_cleanup)
    {
      ret = bk7258_wifi_monitor_stop_capture();
      if (ret < 0) return ret;
      priv->local_monitor_cleanup = false;
    }
  ret = bk7258_wifi_read_link(&link);
  if (ret < 0) return ret;
  if (link.link_state == BK7258_WIFI_LINK_CONNECTED)
    {
      if (!switch_sta) return -EBUSY;
      if (__atomic_load_n(&priv->local_cancel, __ATOMIC_ACQUIRE))
        return -ECANCELED;
      ret = bk7258_wifi_stop_sta();
      if (ret < 0) return ret;
      priv->saved_valid = false;
      explicit_bzero(&priv->saved_connection, sizeof(priv->saved_connection));
      for (uint32_t waited = 0; waited < 5000; waited += 25)
        {
          if (__atomic_load_n(&priv->local_cancel, __ATOMIC_ACQUIRE))
            return -ECANCELED;
          ret = bk7258_wifi_read_link(&link);
          if (ret < 0) return ret;
          if (link.link_state != BK7258_WIFI_LINK_CONNECTED) break;
          nxsig_usleep(25000);
        }
      if (link.link_state == BK7258_WIFI_LINK_CONNECTED) return -ETIMEDOUT;
      ret = bk7258_wifi_sync_native_link(&link);
      if (ret < 0) return ret;
    }
  for (uint32_t channel = 1; channel <= BK7258_WIFI_CHANNEL_STATS_MAX; channel++)
    {
      if (__atomic_load_n(&priv->local_cancel, __ATOMIC_ACQUIRE))
        return -ECANCELED;
      ret = bk7258_wifi_monitor_start_capture(channel);
      if (ret < 0)
        {
          /* EALREADY belongs to another monitor client; never stop it. */
          if (ret != -EALREADY &&
              __atomic_load_n(&g_bk7258_wifi_monitor.active, __ATOMIC_ACQUIRE))
            priv->local_monitor_cleanup = true;
          return ret;
        }
      for (uint32_t elapsed = 0; elapsed < dwell_ms; elapsed += 25)
        {
          if (__atomic_load_n(&priv->local_cancel, __ATOMIC_ACQUIRE)) break;
          nxsig_usleep(25000);
        }
      bk7258_wifi_monitor_snapshot(&result->channels[result->returned]);
      stop_ret = bk7258_wifi_monitor_stop_capture();
      result->channels[result->returned].status = stop_ret;
      result->returned++;
      if (stop_ret < 0)
        { priv->local_monitor_cleanup = true; return stop_ret; }
    }
  return __atomic_load_n(&priv->local_cancel, __ATOMIC_ACQUIRE) ?
         -ECANCELED : OK;
}

static int bk7258_wifi_submit_connect(const char *ssid, const char *password,
                                      uint32_t timeout_ms, uint32_t *ticket,
                                      bool trial)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  size_t ssid_size, password_size;
  bool expected = false;
  int ret;
  if (ssid == NULL || password == NULL || ticket == NULL ||
      timeout_ms < BK7258_WIFI_CONNECT_MIN_MS ||
      timeout_ms > BK7258_WIFI_CONNECT_MAX_MS) return -EINVAL;
  ssid_size = strnlen(ssid, BK7258_WIFI_SSID_MAX_LEN + 1);
  password_size = strnlen(password, BK7258_WIFI_PASSWORD_MAX_LEN + 1);
  if (ssid_size == 0 || ssid_size > BK7258_WIFI_SSID_MAX_LEN ||
      !bk7258_wifi_password_length_valid(password_size)) return -EINVAL;
  if (!priv->initialized) return -EAGAIN;
  ret = nxmutex_lock(&g_bk7258_wifi_local_lock);
  if (ret < 0) return ret;
  if (priv->local_pending)
    { ret = -EBUSY; goto out; }
  if (priv->local_ticket == UINT32_MAX)
    { ret = -EOVERFLOW; goto out; }
  if (!__atomic_compare_exchange_n(&priv->busy,&expected,true,false,
                                    __ATOMIC_ACQ_REL,__ATOMIC_ACQUIRE))
    { ret = -EBUSY; goto out; }
  memset(&priv->request,0,sizeof(priv->request));
  priv->request.operation = trial ? BK7258_WIFI_TRIAL_CONNECT : BK7258_WIFI_OPERATION_CONNECT;
  priv->request.timeout_ms = timeout_ms;
  priv->request.ssid_len = ssid_size;
  priv->request.password_len = password_size;
  memcpy(priv->request.ssid,ssid,ssid_size);
  memcpy(priv->request.password,password,password_size);
  priv->request_local = true;
  priv->local_scan = false;
  priv->local_channels = false;
  priv->local_ping = false;
  priv->local_pending = true;
  priv->local_done = false;
  __atomic_store_n(&priv->local_cancel,false,__ATOMIC_RELEASE);
  *ticket = ++priv->local_ticket;
  if (trial)
    {
      priv->trial_active = true;
      priv->trial_lease = *ticket;
      priv->trial_touched = false;
      priv->trial_connected = false;
      priv->trial_restore_failed = false;
    }
  __asm volatile ("dmb sy" ::: "memory");
  ret = nxsem_post(&priv->request_sem);
  if (ret < 0)
    {
      explicit_bzero(&priv->request,sizeof(priv->request));
      priv->local_pending = false;
      if (trial) priv->trial_active = false;
      __atomic_store_n(&priv->busy,false,__ATOMIC_RELEASE);
    }
out:
  nxmutex_unlock(&g_bk7258_wifi_local_lock);
  return ret;
}

/* AP callers use the same pinned worker and reservation as CP requests. */
static int bk7258_wifi_diagnostic_submit(uint32_t timeout_ms,
                                           uint32_t *ticket, bool channels,
                                           bool channels_switch, bool ping)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  bool expected = false;
  int ret;

  if (ticket == NULL ||
      (ping ? (timeout_ms < 1000u || timeout_ms > 5000u) :
       (channels ? (timeout_ms < 100u || timeout_ms > 1000u) :
       (timeout_ms < BK7258_WIFI_SCAN_MIN_MS ||
        timeout_ms > BK7258_WIFI_CONNECT_MAX_MS)))) return -EINVAL;
  if (!priv->initialized) return -EAGAIN;
  ret = nxmutex_lock(&g_bk7258_wifi_local_lock);
  if (ret < 0) return ret;
  if (priv->local_pending) { ret = -EBUSY; goto out; }
  if (priv->local_ticket == UINT32_MAX) { ret = -EOVERFLOW; goto out; }
  if (!__atomic_compare_exchange_n(&priv->busy, &expected, true, false,
                                   __ATOMIC_ACQ_REL, __ATOMIC_ACQUIRE))
    { ret = -EBUSY; goto out; }
  memset(&priv->request, 0, sizeof(priv->request));
  priv->request.operation = ping ? BK7258_WIFI_OPERATION_PING : (channels ?
                                     (channels_switch ? BK7258_WIFI_LOCAL_CHANNELS_SWITCH :
                                      BK7258_WIFI_LOCAL_CHANNELS) :
                                     BK7258_WIFI_OPERATION_SCAN);
  priv->request.timeout_ms = timeout_ms;
  priv->request_local = true;
  priv->local_scan = !ping;
  priv->local_channels = channels;
  priv->local_ping = ping;
  priv->local_pending = true;
  priv->local_done = false;
  if (!channels)
    {
      memset(&priv->local_scan_result, 0, sizeof(priv->local_scan_result));
      memset(&priv->local_scan_snapshot, 0,
             sizeof(priv->local_scan_snapshot));
    }
  __atomic_store_n(&priv->local_cancel, false, __ATOMIC_RELEASE);
  *ticket = ++priv->local_ticket;
  __asm volatile ("dmb sy" ::: "memory");
  ret = nxsem_post(&priv->request_sem);
  if (ret < 0)
    {
      memset(&priv->request, 0, sizeof(priv->request));
      priv->local_pending = false;
      __atomic_store_n(&priv->busy, false, __ATOMIC_RELEASE);
    }
out:
  nxmutex_unlock(&g_bk7258_wifi_local_lock);
  return ret;
}

int bk7258_wifi_scan_async(uint32_t timeout_ms, uint32_t *ticket)
{
  return bk7258_wifi_diagnostic_submit(timeout_ms, ticket, false, false, false);
}

int bk7258_wifi_channels_async(uint32_t dwell_ms, uint32_t *ticket)
{
  return bk7258_wifi_diagnostic_submit(dwell_ms, ticket, true, false, false);
}

int bk7258_wifi_channels_switch_async(uint32_t dwell_ms, uint32_t *ticket)
{
  return bk7258_wifi_diagnostic_submit(dwell_ms, ticket, true, true, false);
}

int bk7258_wifi_ping_async(uint32_t timeout_ms, uint32_t *ticket)
{
  return bk7258_wifi_diagnostic_submit(timeout_ms, ticket, false, false, true);
}

int bk7258_wifi_diagnostic_cancel(uint32_t ticket)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  int ret = nxmutex_lock(&g_bk7258_wifi_local_lock);
  if (ret < 0) return ret;
  if (!priv->local_pending || !priv->local_scan ||
      ticket != priv->local_ticket) ret = -ESTALE;
  else if (priv->local_done) ret = -EALREADY;
  else
    {
      __atomic_store_n(&priv->local_cancel, true, __ATOMIC_RELEASE);
      ret = 0;
    }
  nxmutex_unlock(&g_bk7258_wifi_local_lock);
  return ret;
}

int bk7258_wifi_ping_cancel(uint32_t ticket)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  int ret = nxmutex_lock(&g_bk7258_wifi_local_lock);
  if (ret < 0) return ret;
  if (!priv->local_pending || !priv->local_ping ||
      ticket != priv->local_ticket) ret = -ESTALE;
  else if (priv->local_done) ret = -EALREADY;
  else
    {
      __atomic_store_n(&priv->local_cancel, true, __ATOMIC_RELEASE);
      ret = 0;
    }
  nxmutex_unlock(&g_bk7258_wifi_local_lock);
  return ret;
}

int bk7258_wifi_channels_poll(uint32_t ticket,
                             struct bk7258_wifi_channel_stats_s *result)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  int ret;
  if (result == NULL || ticket == 0) return -EINVAL;
  ret = nxmutex_lock(&g_bk7258_wifi_local_lock);
  if (ret < 0) return ret;
  if (!priv->local_pending || !priv->local_channels ||
      ticket != priv->local_ticket) ret = -ESTALE;
  else if (!priv->local_done) ret = -EAGAIN;
  else
    {
      *result = priv->local_channel_result;
      memset(&priv->local_channel_result, 0, sizeof(priv->local_channel_result));
      priv->local_pending = false;
      priv->local_done = false;
      ret = 0;
    }
  nxmutex_unlock(&g_bk7258_wifi_local_lock);
  return ret;
}

int bk7258_wifi_ping_poll(uint32_t ticket,
                          FAR struct bk7258_wifi_result_s *result)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  int ret;

  if (result == NULL || ticket == 0) return -EINVAL;
  ret = nxmutex_lock(&g_bk7258_wifi_local_lock);
  if (ret < 0) return ret;
  if (!priv->local_pending || !priv->local_ping ||
      ticket != priv->local_ticket) ret = -ESTALE;
  else if (!priv->local_done) ret = -EAGAIN;
  else
    {
      *result = priv->local_result;
      memset(&priv->local_result, 0, sizeof(priv->local_result));
      priv->local_pending = false;
      priv->local_done = false;
      ret = 0;
    }
  nxmutex_unlock(&g_bk7258_wifi_local_lock);
  return ret;
}

int bk7258_wifi_scan_poll(uint32_t ticket,
                         struct bk7258_wifi_scan_result_s *result)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  int ret;
  if (result == NULL || ticket == 0) return -EINVAL;
  ret = nxmutex_lock(&g_bk7258_wifi_local_lock);
  if (ret < 0) return ret;
  if (!priv->local_pending || !priv->local_scan || priv->local_channels ||
      ticket != priv->local_ticket) ret = -ESTALE;
  else if (!priv->local_done) ret = -EAGAIN;
  else
    {
      *result = priv->local_scan_result;
      memset(&priv->local_scan_result, 0, sizeof(priv->local_scan_result));
      memset(&priv->local_scan_snapshot, 0,
             sizeof(priv->local_scan_snapshot));
      priv->local_pending = false;
      priv->local_done = false;
      ret = 0;
    }
  nxmutex_unlock(&g_bk7258_wifi_local_lock);
  return ret;
}

int bk7258_wifi_scan_snapshot_poll(
  uint32_t ticket, FAR struct bk7258_wifi_scan_snapshot_s *result)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  int ret;

  if (result == NULL || ticket == 0) return -EINVAL;
  ret = nxmutex_lock(&g_bk7258_wifi_local_lock);
  if (ret < 0) return ret;
  if (!priv->local_pending || !priv->local_scan || priv->local_channels ||
      ticket != priv->local_ticket) ret = -ESTALE;
  else if (!priv->local_done) ret = -EAGAIN;
  else
    {
      *result = priv->local_scan_snapshot;
      memset(&priv->local_scan_snapshot, 0,
             sizeof(priv->local_scan_snapshot));
      memset(&priv->local_scan_result, 0, sizeof(priv->local_scan_result));
      priv->local_pending = false;
      priv->local_done = false;
      ret = 0;
    }
  nxmutex_unlock(&g_bk7258_wifi_local_lock);
  return ret;
}

