open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_wifi_control.c
int bk7258_wifi_connect_async(const char *ssid, const char *password,
                              uint32_t timeout_ms, uint32_t *ticket)
{
  return bk7258_wifi_submit_connect(ssid, password, timeout_ms, ticket, false);
}

int bk7258_wifi_trial_start(const char *ssid, const char *password,
                            uint32_t timeout_ms, uint32_t *lease)
{
  return bk7258_wifi_submit_connect(ssid, password, timeout_ms, lease, true);
}

int bk7258_wifi_trial_finish(uint32_t lease, bool commit, uint32_t *ticket)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  if (ticket == NULL || lease == 0) return -EINVAL;
  int ret = nxmutex_lock(&g_bk7258_wifi_local_lock);
  if (ret < 0) return ret;
  if (priv->local_pending) ret = -EBUSY;
  else if (!priv->trial_active || priv->trial_lease != lease) ret = -ESTALE;
  else if (commit && (!priv->trial_connected || priv->trial_restore_failed)) ret = -EPERM;
  else if (priv->local_ticket == UINT32_MAX) ret = -EOVERFLOW;
  else
    {
      memset(&priv->request, 0, sizeof(priv->request));
      priv->request.operation = commit ? BK7258_WIFI_TRIAL_COMMIT : BK7258_WIFI_TRIAL_RESTORE;
      priv->request_local = true;
      priv->local_pending = true;
      priv->local_done = false;
      __atomic_store_n(&priv->local_cancel, false, __ATOMIC_RELEASE);
      *ticket = ++priv->local_ticket;
      __asm volatile ("dmb sy" ::: "memory");
      ret = nxsem_post(&priv->request_sem);
      if (ret < 0)
        {
          explicit_bzero(&priv->request, sizeof(priv->request));
          priv->local_pending = false;
        }
    }
  nxmutex_unlock(&g_bk7258_wifi_local_lock);
  return ret;
}

int bk7258_wifi_connect_poll(uint32_t ticket,
                             struct bk7258_wifi_result_s *result)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  int ret;
  if (result == NULL || ticket == 0) return -EINVAL;
  ret = nxmutex_lock(&g_bk7258_wifi_local_lock);
  if (ret < 0) return ret;
  if (!priv->local_pending || priv->local_scan || priv->local_ping ||
      ticket != priv->local_ticket) ret = -ESTALE;
  else if (!priv->local_done) ret = -EAGAIN;
  else
    {
      *result = priv->local_result;
      memset(&priv->local_result,0,sizeof(priv->local_result));
      priv->local_pending = false;
      priv->local_done = false;
      ret = 0;
    }
  nxmutex_unlock(&g_bk7258_wifi_local_lock);
  return ret;
}

int bk7258_wifi_connect_cancel(uint32_t ticket)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  int ret = nxmutex_lock(&g_bk7258_wifi_local_lock);
  if (ret < 0) return ret;
  if (!priv->local_pending || priv->local_scan || priv->local_ping ||
      ticket != priv->local_ticket) ret = -ESTALE;
  else if (priv->local_done) ret = -EALREADY;
  else
    {
      __atomic_store_n(&priv->local_cancel,true,__ATOMIC_RELEASE);
      ret = 0;
    }
  nxmutex_unlock(&g_bk7258_wifi_local_lock);
  return ret;
}

static bool bk7258_wifi_local_cancelled(void)
{
  return g_bk7258_wifi_control.request_local &&
         __atomic_load_n(&g_bk7258_wifi_control.local_cancel,__ATOMIC_ACQUIRE);
}

static int bk7258_wifi_connect(
  FAR const struct bk7258_wifi_control_wire_s *request,
  FAR struct bk7258_wifi_result_s *result)
{
  struct bk7258_wifi_sta_config_s config;
  clock_t started;
  bool started_sta = false;
  int ret;

  if (bk7258_wifi_local_cancelled()) return -ECANCELED;

  if (request->ssid_len == 0 ||
      request->ssid_len > BK7258_WIFI_SSID_MAX_LEN ||
      !bk7258_wifi_password_length_valid(request->password_len) ||
      request->ssid[request->ssid_len] != '\0' ||
      request->password[request->password_len] != '\0')
    {
      return -EINVAL;
    }

#if defined(CONFIG_BK7258_WIFI_PACKET_DIAG) && \
    !defined(CONFIG_BK7258_AP_CORE)
  bk7258_wifi_packet_diag_reset();
#endif

  memset(&config, 0, sizeof(config));
  memcpy(config.ssid, request->ssid, request->ssid_len);
  memcpy(config.password, request->password, request->password_len);
  config.security = BK7258_WIFI_SECURITY_AUTO;

  /* The official v3.1.1.9 API requires stop-before-restart.  In particular,
   * bk_wifi_sta_start() returns success without issuing another controller
   * command when STA is already marked started.  Always stop first so a
   * failed password attempt cannot prevent the next runtime credential set
   * from taking effect.
   */

  started = clock_systime_ticks();
  ret = bk7258_wifi_stop_sta();
  if (ret < 0)
    {
      explicit_bzero(&config, sizeof(config));
      return ret;
    }

  /* A previously connected indication is asynchronous to STA_STOP.  Wait
   * until it is withdrawn before starting the new generation; otherwise an
   * old lease could make the new CONNECT request report a false success.
   */

  for (;;)
    {
      if (bk7258_wifi_local_cancelled())
        {
          explicit_bzero(&config, sizeof(config));
          return -ECANCELED;
        }
      ret = bk7258_wifi_read_link(result);
      if (ret == OK &&
          result->link_state != BK7258_WIFI_LINK_CONNECTED)
        {
          break;
        }

      if ((clock_systime_ticks() - started) >=
          MSEC2TICK(request->timeout_ms))
        {
          explicit_bzero(&config, sizeof(config));
          return -ETIMEDOUT;
        }

      nxsig_usleep(BK7258_WIFI_CONTROL_POLL_MS * 1000u);
    }

  ret = bk7258_wifi_sync_native_link(result);
  if (ret < 0)
    {
      explicit_bzero(&config, sizeof(config));
      return ret;
    }

  ret = bk7258_wifi_vendor_result(bk_wifi_sta_set_config(&config));
  explicit_bzero(&config, sizeof(config));
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_wifi_vendor_result(bk_wifi_sta_start());
  if (ret < 0)
    {
      return ret;
    }

  started_sta = true;
  for (;;)
    {
      if (bk7258_wifi_local_cancelled())
        {
          ret = -ECANCELED;
          break;
        }
      ret = bk7258_wifi_read_link(result);
      if (ret == OK &&
          result->link_state == BK7258_WIFI_LINK_CONNECTED &&
          result->ipaddr != 0)
        {
          break;
        }

