open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_wifi_control.c
      if ((clock_systime_ticks() - started) >=
          MSEC2TICK(request->timeout_ms))
        {
          ret = -ETIMEDOUT;
          break;
        }

      nxsig_usleep(BK7258_WIFI_CONTROL_POLL_MS * 1000u);
    }

  if (ret == OK)
    {
      ret = bk7258_wifi_sync_native_link(result);
    }

  if (ret < 0 && started_sta)
    {
      /* Leave a failed attempt stopped and carrier-down.  The next CONNECT
       * can then install new runtime credentials deterministically.
       */

      (void)bk7258_wifi_stop_sta();
      (void)bk7258_wifi_sync_native_link(result);
    }

  return ret;
}

/* Executed exclusively by the existing controller worker. */
static int bk7258_wifi_trial_run(struct bk7258_wifi_control_dev_s *priv,
                                 const struct bk7258_wifi_control_wire_s *request,
                                 struct bk7258_wifi_result_s *result)
{
  int ret = 0;
  if (request->operation == BK7258_WIFI_TRIAL_CONNECT)
    {
      ret = bk7258_wifi_read_link(result);
      if (ret < 0) return ret;
      priv->trial_was_connected = result->link_state == BK7258_WIFI_LINK_CONNECTED;
      if (priv->trial_was_connected && !priv->saved_valid) return -ENOKEY;
      priv->trial_connection = *request;
      priv->trial_touched = true;
      ret = bk7258_wifi_connect(request, result);
      priv->trial_connected = ret == 0;
      return ret;
    }
  if (request->operation == BK7258_WIFI_TRIAL_COMMIT)
    {
      priv->saved_connection = priv->trial_connection;
      priv->saved_valid = true;
    }
  else if (priv->trial_touched)
    {
      if (priv->trial_was_connected)
        ret = bk7258_wifi_connect(&priv->saved_connection, result);
      else
        {
          ret = bk7258_wifi_stop_sta();
          if (ret == 0) ret = bk7258_wifi_sync_native_link(result);
          if (ret == 0 && result->link_state == BK7258_WIFI_LINK_CONNECTED) ret = -EAGAIN;
        }
      if (ret < 0)
        {
          priv->trial_restore_failed = true;
          return ret;
        }
    }
  explicit_bzero(&priv->trial_connection, sizeof(priv->trial_connection));
  priv->trial_active = false;
  priv->trial_touched = false;
  priv->trial_connected = false;
  return 0;
}

static void bk7258_wifi_control_report_immediate(
  FAR const struct bk7258_wifi_control_wire_s *request, int status)
{
  struct bk7258_wifi_control_wire_s report;

  memset(&report, 0, sizeof(report));
  report.magic = BK7258_WIFI_CONTROL_MAGIC;
  report.version = BK7258_WIFI_CONTROL_VERSION;
  report.command = BK7258_WIFI_CONTROL_COMMAND_REPORT;
  report.generation = request->generation;
  report.sequence = request->sequence;
  report.operation = request->operation;
  report.result.status = status;
  report.monitor_result.status = status;
  report.scan_result.status = status;

  /* This helper runs in the RPMsg receive callback.  Never sleep there. */

  if (bk7258_wifi_control_endpoint_ready())
    {
      (void)rpmsg_trysend(&g_bk7258_wifi_control.ept, &report,
                          sizeof(report));
    }
}

static FAR void *bk7258_wifi_control_worker(FAR void *arg)
{
  struct bk7258_wifi_control_dev_s *priv = arg;
  struct bk7258_wifi_control_wire_s request;
  struct bk7258_wifi_control_wire_s report;
  struct bk7258_wifi_result_s link;
  int wait_ret;
  int status;

  for (;;)
    {
      /* Keep the SDK event task out of the NuttX wrapper.  A bounded poll on
       * this pinned CPU0 worker catches late DHCP completion and disconnects
       * without running native netdev operations in a vendor callback.
       */

      wait_ret = nxsem_tickwait_uninterruptible(
        &priv->request_sem, MSEC2TICK(BK7258_WIFI_LINK_SYNC_MS));

      if (__atomic_load_n(&priv->abort, __ATOMIC_ACQUIRE))
        {
          break;
        }

      if (wait_ret == -ETIMEDOUT)
        {
          if (!__atomic_load_n(&priv->busy, __ATOMIC_ACQUIRE) &&
              __atomic_load_n(&g_bk7258_wifi_monitor.active,
                              __ATOMIC_ACQUIRE) == 0)
            {
              (void)bk7258_wifi_sync_native_link(&link);
            }

          continue;
        }

      if (wait_ret < 0)
        {
          continue;
        }

      if (!__atomic_load_n(&priv->busy, __ATOMIC_ACQUIRE))
        {
          continue;
        }

      __asm volatile ("dmb sy" ::: "memory");
      memcpy(&request, &priv->request, sizeof(request));
      explicit_bzero(&priv->request, sizeof(priv->request));

      memset(&report, 0, sizeof(report));
      report.magic = BK7258_WIFI_CONTROL_MAGIC;
      report.version = BK7258_WIFI_CONTROL_VERSION;
      report.command = BK7258_WIFI_CONTROL_COMMAND_REPORT;
      report.generation = request.generation;
      report.sequence = request.sequence;
      report.operation = request.operation;

      if (!priv->request_local &&
          !bk7258_wifi_control_generation_ready(request.generation))
        {
          status = -ESTALE;
        }
      else if (request.operation == BK7258_WIFI_LOCAL_CHANNELS ||
               request.operation == BK7258_WIFI_LOCAL_CHANNELS_SWITCH)
        {
          status = priv->request_local ?
                   bk7258_wifi_channels_run(request.timeout_ms,
                     request.operation == BK7258_WIFI_LOCAL_CHANNELS_SWITCH) : -EPERM;
          priv->local_channel_result.status = status;
        }
      else if (request.operation >= BK7258_WIFI_TRIAL_CONNECT)
        {
          if (!priv->request_local || !priv->trial_active ||
              request.operation > BK7258_WIFI_TRIAL_RESTORE)
            status = -EPERM;
          else if (request.operation == BK7258_WIFI_TRIAL_CONNECT &&
                   __atomic_load_n(&g_bk7258_wifi_monitor.active, __ATOMIC_ACQUIRE) != 0)
            status = -EBUSY;
          else
            status = bk7258_wifi_trial_run(priv, &request, &report.result);
        }
      else if (request.operation == BK7258_WIFI_OPERATION_CONNECT &&
               __atomic_load_n(&g_bk7258_wifi_monitor.active,
                               __ATOMIC_ACQUIRE) != 0)
        {
          status = -EBUSY;
        }
      else if (request.operation == BK7258_WIFI_OPERATION_CONNECT)
        {
          status = bk7258_wifi_connect(&request, &report.result);
          if (status == 0)
            {
              priv->saved_connection = request;
              priv->saved_valid = true;
            }
          else
            {
              priv->saved_valid = false;
              explicit_bzero(&priv->saved_connection, sizeof(priv->saved_connection));
            }
        }
      else if (request.operation == BK7258_WIFI_OPERATION_STATUS)
        {
          status = bk7258_wifi_read_status(&report.result);
        }
      else if (request.operation == BK7258_WIFI_OPERATION_PING)
        {
          if (priv->request_local &&
              __atomic_load_n(&priv->local_cancel, __ATOMIC_ACQUIRE))
            {
              status = -ECANCELED;
            }
          else if (__atomic_load_n(&g_bk7258_wifi_monitor.active,
                              __ATOMIC_ACQUIRE) != 0)
            {
              status = -EBUSY;
            }
          else
            {
              status = bk7258_wifi_ping_gateway(&report.result,
                                                request.timeout_ms);
              if (priv->request_local &&
                  __atomic_load_n(&priv->local_cancel, __ATOMIC_ACQUIRE))
                status = -ECANCELED;
            }
        }
      else if (request.operation == BK7258_WIFI_OPERATION_TCP_ECHO ||
               request.operation == BK7258_WIFI_OPERATION_UDP_ECHO)
        {
          if (__atomic_load_n(&g_bk7258_wifi_monitor.active,
                              __ATOMIC_ACQUIRE) != 0)
            {
              status = -EBUSY;
            }
          else
            {
              status = bk7258_wifi_echo_exchange(&request, &report.result);
            }
        }
      else if (request.operation == BK7258_WIFI_OPERATION_SCAN)
        {
          if (priv->request_local)
            {
              status = bk7258_wifi_scan(request.timeout_ms,
                                        priv->local_scan_snapshot.aps,
                                        BK7258_WIFI_AP_SCAN_MAX_RESULTS,
                                        &priv->local_scan_snapshot.found,
                                        &priv->local_scan_snapshot.returned,
                                        &priv->local_scan_snapshot.truncated);
            }
          else
            {
              status = bk7258_wifi_scan(request.timeout_ms,
                                        report.scan_result.aps,
                                        BK7258_WIFI_SCAN_MAX_RESULTS,
                                        &report.scan_result.found,
                                        &report.scan_result.returned,
                                        &report.scan_result.truncated);
            }
        }
      else if (request.operation == BK7258_WIFI_OPERATION_MONITOR_START)
        {
          status = bk7258_wifi_monitor_start_capture(
            request.monitor_channel);
          bk7258_wifi_monitor_snapshot(&report.monitor_result);
        }
      else if (request.operation == BK7258_WIFI_OPERATION_MONITOR_STOP)
        {
          status = bk7258_wifi_monitor_stop_capture();
          bk7258_wifi_monitor_snapshot(&report.monitor_result);
        }
      else if (request.operation == BK7258_WIFI_OPERATION_MONITOR_STATUS)
        {
          status = OK;
          bk7258_wifi_monitor_snapshot(&report.monitor_result);
        }
      else if (request.operation == BK7258_WIFI_OPERATION_MONITOR_CHANNEL)
        {
          if (__atomic_load_n(&g_bk7258_wifi_monitor.active,
                              __ATOMIC_ACQUIRE) == 0)
            {
              status = -ENETDOWN;
            }
          else
            {
              status = bk7258_wifi_monitor_set_channel(
                request.monitor_channel);
            }

          bk7258_wifi_monitor_snapshot(&report.monitor_result);
        }
      else
        {
          status = -EINVAL;
        }

      report.result.status = status;
      report.monitor_result.status = status;
      report.scan_result.status = status;
      if (priv->request_local)
        {
          nxmutex_lock(&g_bk7258_wifi_local_lock);
          priv->local_result = report.result;
          if (priv->local_scan && !priv->local_channels)
            {
              priv->local_scan_snapshot.status = status;
              bk7258_wifi_scan_result_from_snapshot(
                &priv->local_scan_result, &priv->local_scan_snapshot);
            }
          else
            {
              priv->local_scan_result = report.scan_result;
            }
          if (priv->local_scan)
            {
              syslog(LOG_INFO, "wifi-diagnostic: channels=%u status=%d count=%lu\n",
                     priv->local_channels ? 1u : 0u, status,
                     (unsigned long)(priv->local_channels ?
                       priv->local_channel_result.returned :
                       priv->local_scan_snapshot.returned));
            }
          /* Release/retain busy before publishing completion so finish cannot
           * enqueue a new job that the old worker tail accidentally unlocks. */
          __atomic_store_n(&priv->busy, priv->trial_active, __ATOMIC_RELEASE);
          priv->local_done = true;
          nxmutex_unlock(&g_bk7258_wifi_local_lock);
        }
      else
        {
          (void)bk7258_wifi_control_send_bounded(&report);
          __atomic_store_n(&priv->busy, false, __ATOMIC_RELEASE);
        }
      explicit_bzero(&request, sizeof(request));
    }

