open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_wifi_control.c
  return NULL;
}

static int bk7258_wifi_control_spawn_worker(void)
{
  pthread_attr_t attr;
  struct sched_param param;
  cpu_set_t cpuset = (cpu_set_t)1u;
  pthread_t thread;
  bool initialized = false;
  int ret;

  ret = pthread_attr_init(&attr);
  if (ret == 0)
    {
      initialized = true;
      ret = pthread_attr_setdetachstate(&attr, PTHREAD_CREATE_DETACHED);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setstacksize(&attr,
                                      CONFIG_BK7258_WIFI_CONTROL_STACKSIZE);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setaffinity_np(&attr, sizeof(cpuset), &cpuset);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setinheritsched(&attr, PTHREAD_EXPLICIT_SCHED);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setschedpolicy(&attr, SCHED_FIFO);
    }

  if (ret == 0)
    {
      memset(&param, 0, sizeof(param));
      param.sched_priority = CONFIG_BK7258_WIFI_CONTROL_PRIORITY;
      ret = pthread_attr_setschedparam(&attr, &param);
    }

  if (ret == 0)
    {
      ret = pthread_create(&thread, &attr, bk7258_wifi_control_worker,
                           &g_bk7258_wifi_control);
      if (ret == 0)
        {
          (void)pthread_setname_np(thread, "bk-wifi-ctl");
        }
    }

  if (initialized)
    {
      (void)pthread_attr_destroy(&attr);
    }

  return ret == 0 ? OK : -ret;
}
#endif /* CONFIG_BK7258_AP_CORE */

static int bk7258_wifi_control_ept_cb(FAR struct rpmsg_endpoint *ept,
                                       FAR void *data, size_t length,
                                       uint32_t source, FAR void *arg)
{
  struct bk7258_wifi_control_dev_s *priv = arg;
  FAR struct bk7258_wifi_control_wire_s *message = data;

  (void)ept;
  (void)source;
  if (message == NULL || length != sizeof(*message) ||
      message->magic != BK7258_WIFI_CONTROL_MAGIC ||
      message->version != BK7258_WIFI_CONTROL_VERSION)
    {
      return -EINVAL;
    }

#ifdef CONFIG_BK7258_AP_CORE
  if (message->command == BK7258_WIFI_CONTROL_COMMAND_REQUEST)
    {
      bool expected = false;

      if (!__atomic_compare_exchange_n(&priv->busy, &expected, true, false,
                                       __ATOMIC_ACQ_REL, __ATOMIC_ACQUIRE))
        {
          bk7258_wifi_control_report_immediate(message, -EBUSY);
          explicit_bzero(data, length);
          return OK;
        }

      memcpy(&priv->request, message, sizeof(priv->request));
      priv->request_local = false;
      __asm volatile ("dmb sy" ::: "memory");
      explicit_bzero(data, length);
      (void)nxsem_post(&priv->request_sem);
      return OK;
    }
#else
  if (message->command == BK7258_WIFI_CONTROL_COMMAND_REPORT &&
      message->generation == priv->waiting_generation &&
      message->sequence == priv->waiting_sequence)
    {
      memcpy(&priv->report, &message->result, sizeof(priv->report));
      memcpy(&priv->monitor_report, &message->monitor_result,
             sizeof(priv->monitor_report));
      memcpy(&priv->scan_report, &message->scan_result,
             sizeof(priv->scan_report));
      __asm volatile ("dmb sy" ::: "memory");
      priv->report_valid = true;
      (void)nxsem_post(&priv->report_sem);
      return OK;
    }
#endif

  return -ENOMSG;
}

static void bk7258_wifi_control_device_created(
  FAR struct rpmsg_device *rdev, FAR void *arg)
{
  struct bk7258_wifi_control_dev_s *priv = arg;
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);

  if (cpuname == NULL ||
      strcmp(cpuname, BK7258_WIFI_CONTROL_REMOTE_NAME) != 0)
    {
      return;
    }

#ifdef CONFIG_BK7258_AP_CORE
  priv->ept.priv = priv;
  priv->connection_error = rpmsg_create_ept(
    &priv->ept, rdev, BK7258_WIFI_CONTROL_EPT_NAME,
    RPMSG_ADDR_ANY, RPMSG_ADDR_ANY, bk7258_wifi_control_ept_cb, NULL);
  if (priv->connection_error >= 0)
    {
      __atomic_store_n(&priv->endpoint_created, true, __ATOMIC_RELEASE);
    }
#else
  priv->connection_error = OK;
#endif
}

#ifndef CONFIG_BK7258_AP_CORE
static void bk7258_wifi_control_flush_sem(FAR sem_t *sem)
{
  while (nxsem_trywait(sem) == OK)
    {
    }
}

static bool bk7258_wifi_control_ns_match(FAR struct rpmsg_device *rdev,
                                         FAR void *arg,
                                         FAR const char *name,
                                         uint32_t dest)
{
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);

  (void)arg;
  (void)dest;
  return cpuname != NULL &&
         strcmp(cpuname, BK7258_WIFI_CONTROL_REMOTE_NAME) == 0 &&
         strcmp(name, BK7258_WIFI_CONTROL_EPT_NAME) == 0;
}

static void bk7258_wifi_control_ns_bind(FAR struct rpmsg_device *rdev,
                                        FAR void *arg,
                                        FAR const char *name,
                                        uint32_t dest)
{
  struct bk7258_wifi_control_dev_s *priv = arg;

  priv->ept.priv = priv;
  priv->connection_error = rpmsg_create_ept(
    &priv->ept, rdev, name, RPMSG_ADDR_ANY, dest,
    bk7258_wifi_control_ept_cb, NULL);
  if (priv->connection_error >= 0)
    {
      __atomic_store_n(&priv->endpoint_created, true, __ATOMIC_RELEASE);
    }
}
#endif

static void bk7258_wifi_control_device_destroy(
  FAR struct rpmsg_device *rdev, FAR void *arg)
{
  struct bk7258_wifi_control_dev_s *priv = arg;
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);

  if (cpuname == NULL ||
      strcmp(cpuname, BK7258_WIFI_CONTROL_REMOTE_NAME) != 0)
    {
      return;
    }

  __atomic_store_n(&priv->endpoint_created, false, __ATOMIC_RELEASE);
  priv->connection_error = -ENOTCONN;
#ifdef CONFIG_BK7258_AP_CORE
  __atomic_store_n(&priv->abort, true, __ATOMIC_RELEASE);
  (void)nxsem_post(&priv->request_sem);
#else
  priv->report_valid = false;
  (void)nxsem_post(&priv->report_sem);
#endif

  if (priv->ept.rdev != NULL)
    {
      rpmsg_destroy_ept(&priv->ept);
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

#if defined(CONFIG_BK7258_AP_CORE) && !defined(CONFIG_BK7258_ETH)
void arm_netinitialize(void)
{
  /* VNET registers wlan0 after RPMsg is ready; there is no early MAC. */
}
#endif

int bk7258_wifi_control_initialize(void)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  int ret;

  if (priv->initialized)
    {
      return OK;
    }

  memset(priv, 0, sizeof(*priv));
  priv->connection_error = -ENOTCONN;
#ifdef CONFIG_BK7258_AP_CORE
  ret = nxsem_init(&priv->request_sem, 0, 0);
  if (ret >= 0)
    {
      ret = nxsem_init(&priv->scan_sem, 0, 0);
      if (ret < 0)
        {
          nxsem_destroy(&priv->request_sem);
        }
    }
#else
  ret = nxsem_init(&priv->report_sem, 0, 0);
#endif
  if (ret < 0)
    {
      return ret;
    }

