open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_wifi_control.c
  ret = rpmsg_register_callback(
    priv, bk7258_wifi_control_device_created,
    bk7258_wifi_control_device_destroy,
#ifdef CONFIG_BK7258_AP_CORE
    NULL, NULL);
#else
    bk7258_wifi_control_ns_match, bk7258_wifi_control_ns_bind);
#endif
  if (ret < 0)
    {
#ifdef CONFIG_BK7258_AP_CORE
      nxsem_destroy(&priv->request_sem);
      nxsem_destroy(&priv->scan_sem);
#else
      nxsem_destroy(&priv->report_sem);
#endif
      return ret;
    }

#ifdef CONFIG_BK7258_AP_CORE
  ret = bk7258_wifi_control_spawn_worker();
  if (ret < 0)
    {
      rpmsg_unregister_callback(
        priv, bk7258_wifi_control_device_created,
        bk7258_wifi_control_device_destroy, NULL, NULL);
      nxsem_destroy(&priv->request_sem);
      nxsem_destroy(&priv->scan_sem);
      return ret;
    }
#endif

  priv->initialized = true;
  return OK;
}

#ifndef CONFIG_BK7258_AP_CORE
static int bk7258_wifi_control_exchange(
  enum bk7258_wifi_operation_e operation,
  FAR const char *ssid, FAR const char *password,
  FAR const struct bk7258_wifi_echo_s *echo, uint32_t monitor_channel,
  uint32_t timeout_ms, FAR struct bk7258_wifi_result_s *result,
  FAR struct bk7258_wifi_monitor_result_s *monitor_result,
  FAR struct bk7258_wifi_scan_result_s *scan_result)
{
  struct bk7258_wifi_control_dev_s *priv = &g_bk7258_wifi_control;
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  struct bk7258_wifi_control_wire_s request;
  clock_t started;
  size_t ssid_len = 0;
  size_t password_len = 0;
  int ret;

  bool echo_operation = operation == BK7258_WIFI_OPERATION_TCP_ECHO ||
                        operation == BK7258_WIFI_OPERATION_UDP_ECHO;
  bool scan_operation = operation == BK7258_WIFI_OPERATION_SCAN;
  bool monitor_operation =
    operation == BK7258_WIFI_OPERATION_MONITOR_START ||
    operation == BK7258_WIFI_OPERATION_MONITOR_STOP ||
    operation == BK7258_WIFI_OPERATION_MONITOR_STATUS ||
    operation == BK7258_WIFI_OPERATION_MONITOR_CHANNEL;
  bool monitor_channel_operation =
    operation == BK7258_WIFI_OPERATION_MONITOR_START ||
    operation == BK7258_WIFI_OPERATION_MONITOR_CHANNEL;

  if (result == NULL ||
      (operation != BK7258_WIFI_OPERATION_CONNECT &&
       operation != BK7258_WIFI_OPERATION_STATUS &&
       operation != BK7258_WIFI_OPERATION_PING &&
       !echo_operation && !monitor_operation && !scan_operation) ||
      timeout_ms < (monitor_operation ? BK7258_WIFI_MONITOR_MIN_MS :
                    scan_operation ? BK7258_WIFI_SCAN_MIN_MS :
                    echo_operation ? BK7258_WIFI_ECHO_MIN_MS :
                                     BK7258_WIFI_CONNECT_MIN_MS) ||
      timeout_ms > BK7258_WIFI_CONNECT_MAX_MS)
    {
      return -EINVAL;
    }

  if (monitor_operation)
    {
      if (monitor_result == NULL || echo != NULL || ssid != NULL ||
          password != NULL || scan_result != NULL ||
          (monitor_channel_operation &&
           (monitor_channel < BK7258_WIFI_MONITOR_CHANNEL_MIN ||
            monitor_channel > BK7258_WIFI_MONITOR_CHANNEL_MAX)) ||
          (!monitor_channel_operation && monitor_channel != 0))
        {
          return -EINVAL;
        }
    }
  else if (monitor_result != NULL || monitor_channel != 0)
    {
      return -EINVAL;
    }

  if (scan_operation)
    {
      if (scan_result == NULL || echo != NULL || ssid != NULL ||
          password != NULL)
        {
          return -EINVAL;
        }
    }
  else if (scan_result != NULL)
    {
      return -EINVAL;
    }

  if (echo_operation)
    {
      if (echo == NULL || echo->address == 0 ||
          echo->address == UINT32_MAX || echo->port == 0 ||
          echo->port > UINT16_MAX || echo->count == 0 ||
          echo->count > BK7258_WIFI_ECHO_COUNT_MAX || echo->size == 0 ||
          echo->size > BK7258_WIFI_ECHO_SIZE_MAX)
        {
          return -EINVAL;
        }
    }
  else if (echo != NULL)
    {
      return -EINVAL;
    }

  if (operation == BK7258_WIFI_OPERATION_CONNECT)
    {
      if (ssid == NULL || password == NULL)
        {
          return -EINVAL;
        }

      ssid_len = strnlen(ssid, BK7258_WIFI_SSID_MAX_LEN + 1u);
      password_len = strnlen(password,
                             BK7258_WIFI_PASSWORD_MAX_LEN + 1u);
      if (ssid_len == 0 || ssid_len > BK7258_WIFI_SSID_MAX_LEN ||
          !bk7258_wifi_password_length_valid(password_len))
        {
          return -EINVAL;
        }
    }

  memset(result, 0, sizeof(*result));
  if (monitor_result != NULL)
    {
      memset(monitor_result, 0, sizeof(*monitor_result));
    }

  if (scan_result != NULL)
    {
      memset(scan_result, 0, sizeof(*scan_result));
    }

  ret = bk7258_wifi_control_initialize();
  if (ret < 0)
    {
      return ret;
    }

  ret = nxmutex_lock(&g_bk7258_wifi_control_lock);
  if (ret < 0)
    {
      return ret;
    }

  started = clock_systime_ticks();
  while (!bk7258_wifi_control_endpoint_ready() &&
         (clock_systime_ticks() - started) <
         MSEC2TICK(BK7258_WIFI_CONTROL_ENDPOINT_WAIT_MS))
    {
      nxsig_usleep(1000);
    }

  if (!bk7258_wifi_control_endpoint_ready())
    {
      ret = priv->connection_error < 0 ?
            priv->connection_error : -ENOTCONN;
      goto out_unlock;
    }

  bk7258_wifi_control_flush_sem(&priv->report_sem);
  if (++g_bk7258_wifi_control_sequence == 0)
    {
      g_bk7258_wifi_control_sequence++;
    }

  priv->waiting_generation = control->generation;
  priv->waiting_sequence = g_bk7258_wifi_control_sequence;
  priv->report_valid = false;
  memset(&priv->report, 0, sizeof(priv->report));
  memset(&priv->monitor_report, 0, sizeof(priv->monitor_report));
  memset(&priv->scan_report, 0, sizeof(priv->scan_report));

  memset(&request, 0, sizeof(request));
  request.magic = BK7258_WIFI_CONTROL_MAGIC;
  request.version = BK7258_WIFI_CONTROL_VERSION;
  request.command = BK7258_WIFI_CONTROL_COMMAND_REQUEST;
  request.generation = priv->waiting_generation;
  request.sequence = priv->waiting_sequence;
  request.operation = (uint32_t)operation;
  request.timeout_ms = timeout_ms;
  request.ssid_len = (uint32_t)ssid_len;
  request.password_len = (uint32_t)password_len;
  request.monitor_channel = monitor_channel;
  if (echo_operation)
    {
      memcpy(&request.echo, echo, sizeof(request.echo));
    }

  if (ssid_len > 0)
    {
      memcpy(request.ssid, ssid, ssid_len);
      memcpy(request.password, password, password_len);
    }

  ret = bk7258_wifi_control_send_bounded(&request);
  explicit_bzero(&request, sizeof(request));
  if (ret < 0)
    {
      goto out_unlock;
    }

  ret = nxsem_tickwait_uninterruptible(&priv->report_sem,
                                        MSEC2TICK(timeout_ms + 1000u));
  if (ret < 0)
    {
      goto out_unlock;
    }

  __asm volatile ("dmb sy" ::: "memory");
  if (!priv->report_valid)
    {
      ret = priv->connection_error < 0 ?
            priv->connection_error : -EPROTO;
      goto out_unlock;
    }

