open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_wifi_control.c
  memcpy(result, &priv->report, sizeof(*result));
  if (monitor_result != NULL)
    {
      memcpy(monitor_result, &priv->monitor_report,
             sizeof(*monitor_result));
    }

  if (scan_result != NULL)
    {
      memcpy(scan_result, &priv->scan_report, sizeof(*scan_result));
    }

  ret = result->status;

out_unlock:
  nxmutex_unlock(&g_bk7258_wifi_control_lock);
  return ret;
}

int bk7258_wifi_control_request(enum bk7258_wifi_operation_e operation,
                                FAR const char *ssid,
                                FAR const char *password,
                                FAR const struct bk7258_wifi_echo_s *echo,
                                uint32_t timeout_ms,
                                FAR struct bk7258_wifi_result_s *result)
{
  return bk7258_wifi_control_exchange(operation, ssid, password, echo, 0,
                                      timeout_ms, result, NULL, NULL);
}

int bk7258_wifi_monitor_request(
  enum bk7258_wifi_operation_e operation, uint32_t channel,
  uint32_t timeout_ms, FAR struct bk7258_wifi_monitor_result_s *result)
{
  struct bk7258_wifi_result_s ignored;

  return bk7258_wifi_control_exchange(operation, NULL, NULL, NULL, channel,
                                      timeout_ms, &ignored, result, NULL);
}

int bk7258_wifi_scan_request(
  uint32_t timeout_ms, FAR struct bk7258_wifi_scan_result_s *result)
{
  struct bk7258_wifi_result_s ignored;

  return bk7258_wifi_control_exchange(BK7258_WIFI_OPERATION_SCAN,
                                      NULL, NULL, NULL, 0, timeout_ms,
                                      &ignored, NULL, result);
}
#endif

#endif /* CONFIG_BK7258_WIFI_VNET */
